names<-c("1","2","3","4","5","6","7","8","9","10",
         "11","12","13","14","15","16","17","18","19",
         "20","21","22","23","24","25","26","27","28","29","30");
sex<-c("男","男","男","男","女","女","男","男","男",
       "女","女","女","男","女","女","男","女","男","女",
       "女","男","男","男","女","女","女","女","女","男","男");
subject<-c("学","不学","学不学","学","不学","不学",
           "学","学不学","学不学","不学","不学","不学",
           "学不学","学","学","学不学","不学","学不学",
           "学不学","学不学","学不学","学","学不学","不学",
           "学","学不学","学","学不学","学","学");
mark=c(11,22,33,44,55,66,77,88,99,12,23,34,45,56,67,78,89,90,13,24,46,57,68,
       79,14,25,36,47,58,97);
a<-data.frame(姓名=names,姓名=sex,专业=subject,成绩=mark)
a
#n1<-sample(a$姓名,size = 10)#随机抽取10个人，无放回的抽取，size表示，抽取的个数
#n1
#n2<-sample(a$姓名,size = 10,replace = TRUE)#replace = TRUE表示有放回的抽取
#n2

n3<-sample(a$姓名[a$mark > 90])
n3
b <- a[a$mark > 90,]
b